[RPGO_WEAPON_SETTINGS_PAGE JsonConfig_MCM_Builder]
WEAPON_SETTINGS_PAGE_TITLE="RPGO General Setting"
WEAPON_SETTINGS_PAGE_LABEL="RPGO General Settings"

WEAPON_SETTINGS_GROUP_LABEL="Weapon Changes"

PATCH_BULLPUPS_LABEL="Change Bullpups"
PATCH_BULLPUPS_TOOLTIP="Apply RPGO changes to bullpups"

PATCH_SHOTGUNS_LABEL="Change Shotguns"
PATCH_SHOTGUNS_TOOLTIP="Apply RPGO changes to shotguns"

PATCH_CANNONS_LABEL="Change Cannons"
PATCH_CANNONS_TOOLTIP="Apply RPGO changes to cannons"

PATCH_SNIPER_RIFLES_LABEL="Change Sniper Rifles"
PATCH_SNIPER_RIFLES_TOOLTIP="Apply RPGO changes to sniper rifles"

PATCH_PISTOLS_LABEL="Change Pistols"
PATCH_PISTOLS_TOOLTIP="Apply RPGO changes to pistols"

PATCH_AUTO_PISTOLS_LABEL="Change Auto Pistols"
PATCH_AUTO_PISTOLS_TOOLTIP="Apply RPGO changes to auto pistols"

PATCH_SAWEDOFF_SHOTGUN_LABEL="Change Sawed-Off Shotguns"
PATCH_SAWEDOFF_SHOTGUN_TOOLTIP="Apply RPGO changes to Sawed-Off Shotguns"

PATCH_VECTOR_RIFLES_LABEL="Change Vektor Rifles"
PATCH_VECTOR_RIFLES_TOOLTIP="Apply RPGO changes to vektor rifles"

PATCH_DEFAULTWEAPON_UPGRADESLOTS_LABEL="Change default upgrade slots"
PATCH_DEFAULTWEAPON_UPGRADESLOTS_TOOLTIP="Set all upgrade slots to 3"

PATCH_FULLAUTOFIRE_LABEL="Add autofire ability"
PATCH_FULLAUTOFIRE_TOOLTIP="Add autofire abilities to all weapons matching AutofireWeaponCategories"

ATTACHMENT_SETTINGS_GROUP_LABEL="Attachment Changes"

PATCH_HAIR_TRIGGERS_LABEL="Change Hair Triggers"
PATCH_HAIR_TRIGGERS_TOOLTIP="Apply RPGO changes to Hair Triggers"

PATCH_LASER_SIGHTS_LABEL="Change Laser Sights"
PATCH_LASER_SIGHTS_TOOLTIP="Apply RPGO changes to Laser Sights"

PATCH_STOCKS_LABEL="Change Stocks"
PATCH_STOCKS_TOOLTIP="Apply RPGO changes to Stocks"

PATCH_SCOPES_LABEL="Change Scopes"
PATCH_SCOPES_TOOLTIP="Apply RPGO changes to Scopes"

PATCH_AUTOLOADERS_LABEL="Change Autoloaders"
PATCH_AUTOLOADERS_TOOLTIP="Apply RPGO changes to Autoloaders"


[RPGO_SWO_SETTINGS_PAGE JsonConfig_MCM_Builder]
SWO_SETTINGS_PAGE_TITLE="RPGO Second Wave Options"
SWO_SETTINGS_PAGE_LABEL="RPGO Second Wave Options"

SWO_COMMANDERS_CHOICE_LABEL="[RPGO] Commanders Choice"
SWO_SPECIALIZATION_ROULETTE_LABEL="[RPGO] Specialization Roulette / Random Classes"
SWO_TRAINING_ROULETTE_LABEL="[RPGO] Training Roulette"
SWO_ORIGINS_LABEL="[RPGO] Origins"
SWO_WEAPON_RESTRICTIONS_LABEL="[RPGO] Weapon Restrictions"

SPEC_ROULETTE_RANDOM_SPEC_COUNT_LABEL="Specialization"
SPEC_ROULETTE_RANDOM_SPEC_COUNT_TOOLTIP="Amount of random generated specializations on squaddie"

COMMANDERS_CHOICE_SPEC_COUNT_LABEL="Specializations"
COMMANDERS_CHOICE_SPEC_COUNT_TOOLTIP="Amount of specializations you can choose for each soldier on promotion to squaddie"

SPEC_ROULETTE_RANDOM_SPEC_COUNT_COMBI_LABEL="Combined"
SPEC_ROULETTE_RANDOM_SPEC_COUNT_COMBI_TOOLTIP="Amount of random specializations if spec roulette and commander choice is enabled simultaniously"

COMMANDERS_CHOICE_SPEC_COUNT_COMBI_LABEL="Combined"
COMMANDERS_CHOICE_SPEC_COUNT_COMBI_TOOLTIP="Amount of chosen specializations if spec roulette and commander choice is enabled simultaniously"

COMMANDERS_CHOICE_RANDOM_POOL_ENABLED_LABEL="Random pool"
COMMANDERS_CHOICE_RANDOM_POOL_ENABLED_TOOLTIP="When enabled you can only choose from a limited random pool of specs instead of all available specializations."

COMMANDERS_CHOICE_RANDOM_POOL_COUNT_LABEL="Random pool size"
COMMANDERS_CHOICE_RANDOM_POOL_COUNT_TOOLTIP="This determines that size of the random pool. It should always be bigger than the number of commanders choice specs above. If you have the random classes swo enabled, its algorithm will be used for randomization."

TRAINING_ROULETTE_MIN_RANK_LABEL="Min Rank"
TRAINING_ROULETTE_MIN_RANK_TOOLTIP="Start to randomize from this rank on"

TRAINING_ROULETTE_MAX_RANK_LABEL="Max Rank"
TRAINING_ROULETTE_MAX_RANK_TOOLTIP="Randomize abilities up to and including this rank"

ORIGINS_CHOICE_ABILITY_COUNT_LABEL="Chosen Abilties"
ORIGINS_CHOICE_ABILITY_COUNT_TOOLTIP=" How many starting abilities you want to choose on squaddie"

ORIGINS_ADDITIONAL_RANDOM_ABILTIES_LABEL="Random Abilities"
ORIGINS_ADDITIONAL_RANDOM_ABILTIES_TOOLTIP="Add this number of random abilties on top of the chose ones"

ORIGINS_RANDOM_POOL_ENABLED_LABEL="Random pool"
ORIGINS_RANDOM_POOL_ENABLED_TOOLTIP="When enabled you can only choose from a limited random pool of abilities instead of all available starting abilities"

ORIGINS_RANDOM_POOL_COUNT_LABEL="Random pool size"
ORIGINS_RANDOM_POOL_COUNT_TOOLTIP="This determines that size of the random pool. It should always be bigger than the sum of chosen and random abilities above"

WEAPON_RESTRICTIONS_ALWAYS_ALLOW_ASSAULT_RIFLES_LABEL="Always allow assault rifles"
WEAPON_RESTRICTIONS_ALWAYS_ALLOW_ASSAULT_RIFLES_TOOLTIP="Regardless of the individual specializations all soldiers will have access to the assault rifle weapon category"

